benchmarks/results/auth-serialization/test-signin/optimization-01/wrk2-logs/run_1_1805_2040.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 463.216ms, rate sampling interval: 1395ms
  Thread calibration: mean lat.: 575.095ms, rate sampling interval: 1383ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   519.45ms  139.81ms 706.05ms   50.00%
    Req/Sec     1.04      0.19     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  543.74ms
 75.000%  627.20ms
 90.000%  690.17ms
 99.000%  701.44ms
 99.900%  706.56ms
 99.990%  706.56ms
 99.999%  706.56ms
100.000%  706.56ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     278.783     0.000000            1         1.00
     291.327     0.100000            6         1.11
     316.927     0.200000           12         1.25
     521.983     0.300000           19         1.43
     534.015     0.400000           24         1.67
     543.743     0.500000           30         2.00
     548.351     0.550000           34         2.22
     552.959     0.600000           36         2.50
     561.663     0.650000           39         2.86
     567.295     0.700000           42         3.33
     627.199     0.750000           45         4.00
     674.303     0.775000           47         4.44
     675.327     0.800000           49         5.00
     679.423     0.825000           50         5.71
     680.959     0.850000           51         6.67
     682.495     0.875000           53         8.00
     690.175     0.887500           54         8.89
     690.175     0.900000           54        10.00
     694.271     0.912500           55        11.43
     694.783     0.925000           57        13.33
     694.783     0.937500           57        16.00
     694.783     0.943750           57        17.78
     694.783     0.950000           57        20.00
     696.319     0.956250           58        22.86
     696.319     0.962500           58        26.67
     701.439     0.968750           59        32.00
     701.439     0.971875           59        35.56
     701.439     0.975000           59        40.00
     701.439     0.978125           59        45.71
     701.439     0.981250           59        53.33
     706.559     0.984375           60        64.00
     706.559     1.000000           60          inf
#[Mean    =      519.452, StdDeviation   =      139.805]
#[Max     =      706.048, Total count    =           60]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  92 requests in 30.01s, 77.62KB read
Requests/sec:      3.07
Transfer/sec:      2.59KB