benchmarks/results/auth-serialization/test-signin/optimization-01/wrk2-logs/run_2_1805_2040.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 659.131ms, rate sampling interval: 1370ms
  Thread calibration: mean lat.: 668.928ms, rate sampling interval: 1360ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   663.12ms   35.31ms 702.46ms   82.76%
    Req/Sec     1.04      0.19     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  677.89ms
 75.000%  687.61ms
 90.000%  690.17ms
 99.000%  697.85ms
 99.900%  702.97ms
 99.990%  702.97ms
 99.999%  702.97ms
100.000%  702.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     506.367     0.000000            1         1.00
     617.471     0.100000            6         1.11
     638.463     0.200000           12         1.25
     658.943     0.300000           18         1.43
     667.647     0.400000           24         1.67
     677.887     0.500000           29         2.00
     680.447     0.550000           32         2.22
     683.007     0.600000           35         2.50
     685.055     0.650000           38         2.86
     686.591     0.700000           41         3.33
     687.615     0.750000           44         4.00
     688.127     0.775000           45         4.44
     688.639     0.800000           48         5.00
     688.639     0.825000           48         5.71
     689.151     0.850000           51         6.67
     689.151     0.875000           51         8.00
     690.175     0.887500           52         8.89
     691.199     0.900000           53        10.00
     691.199     0.912500           53        11.43
     691.711     0.925000           54        13.33
     694.783     0.937500           55        16.00
     694.783     0.943750           55        17.78
     696.319     0.950000           56        20.00
     696.319     0.956250           56        22.86
     696.319     0.962500           56        26.67
     697.855     0.968750           57        32.00
     697.855     0.971875           57        35.56
     697.855     0.975000           57        40.00
     697.855     0.978125           57        45.71
     697.855     0.981250           57        53.33
     702.975     0.984375           58        64.00
     702.975     1.000000           58          inf
#[Mean    =      663.122, StdDeviation   =       35.312]
#[Max     =      702.464, Total count    =           58]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89 requests in 30.01s, 75.09KB read
Requests/sec:      2.97
Transfer/sec:      2.50KB