benchmarks/results/auth-serialization/test-signin/optimization-01/wrk2-logs/run_3_1805_2041.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signin
  2 threads and 4 connections
  Thread calibration: mean lat.: 671.040ms, rate sampling interval: 1375ms
  Thread calibration: mean lat.: 654.626ms, rate sampling interval: 1357ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   664.35ms   26.36ms 704.51ms   79.31%
    Req/Sec     1.04      0.19     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  669.70ms
 75.000%  684.54ms
 90.000%  689.15ms
 99.000%  693.76ms
 99.900%  705.02ms
 99.990%  705.02ms
 99.999%  705.02ms
100.000%  705.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     575.487     0.000000            1         1.00
     622.591     0.100000            6         1.11
     650.239     0.200000           13         1.25
     658.431     0.300000           18         1.43
     666.623     0.400000           25         1.67
     669.695     0.500000           29         2.00
     671.231     0.550000           32         2.22
     678.911     0.600000           36         2.50
     679.935     0.650000           38         2.86
     681.983     0.700000           41         3.33
     684.543     0.750000           44         4.00
     685.567     0.775000           45         4.44
     686.591     0.800000           48         5.00
     686.591     0.825000           48         5.71
     687.103     0.850000           50         6.67
     688.127     0.875000           51         8.00
     689.151     0.887500           53         8.89
     689.151     0.900000           53        10.00
     689.151     0.912500           53        11.43
     690.687     0.925000           55        13.33
     690.687     0.937500           55        16.00
     690.687     0.943750           55        17.78
     691.199     0.950000           56        20.00
     691.199     0.956250           56        22.86
     691.199     0.962500           56        26.67
     693.759     0.968750           57        32.00
     693.759     0.971875           57        35.56
     693.759     0.975000           57        40.00
     693.759     0.978125           57        45.71
     693.759     0.981250           57        53.33
     705.023     0.984375           58        64.00
     705.023     1.000000           58          inf
#[Mean    =      664.346, StdDeviation   =       26.355]
#[Max     =      704.512, Total count    =           58]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  90 requests in 30.01s, 75.94KB read
Requests/sec:      3.00
Transfer/sec:      2.53KB